//? ReactNative - супер имба

// Было время когда я использовал Android Studio и язык Java (без Script...) это боль...
// Вот парочка примеров...
//* https://github.com/Ivan-Corporation/KomaHuman-FirebaseQuiz
//* https://github.com/Ivan-Corporation/KomaQuiz-AndroidGame - Эта даже есть в Плей Маркете
//* Вот кому интересно) https://play.google.com/store/apps/details?id=komar.corporation.Quiz
//// Скачиваний 0 кста)

// Обратно к React Native...
// Если коротко то позволяет вам создавать приложения на телефон посредством реакт компонент и 
// всего функционала обычного реакт проекта

// Самое приятное здесь в возможности теста через Expo т.е. прямо на вашем телефоне
// Когда я увидел почти что прямое обновление моего приложения прямо в телефоне, посредством изменения
// кода на компе, моя челюсть сделала оборот вокруг тела на 360 градусов... 
//// (Особенно после Андроид Студио где часовой перезапуск эмулятора телефонов...)
// Еще один + в пользу React Native это то что в Андроид Студио вам нужно запускать вирутальную машину в БИОСЕ
// чтобы работать с тамошним эмулятором экранов телефонов
// У меня же это приводит к внезапному синему экрану смерти, не тянет комп виртуальную машинку...
// Принцип работы мы посмотрим далее, вот кста мое давнее взаимодействие с React Native и работа с тамошним API
// Продвинутый урок так сказать)
//* https://github.com/Ivan-Corporation/ReactNative-Koma


//! npx react-native init koma-native