//? Jest - Facebook
// npm i --dev react-test-renderer
// исполнитель тестов на JavaScript, который позволяет взаимодействовать с DOM через jsdom. Несмотря на то,
//  что jsdom только приблизительно реализует работу браузера,
//  в большинстве случаев этого достаточно для тестирования React-компонентов.


//? React Testing Library
// "@testing-library/react": "^11.1.0",
// React Testing Library — это набор вспомогательных функций, позволяющий тестировать React-компоненты
// не полагаясь на их внутреннюю реализацию.Такой подход упрощает рефакторинг, а также
// подталкивает вас применять лучшие практики по улучшению доступности.


//? Cypress
// npm install cypress
// npx cypress open

// Отдельное приложение и работа в браузере, пожалуй самая приятная бибиотека для тестов